In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
train=pd.read_csv('Credit_Risk_Train_data.csv')

In [4]:
train.shape

(679, 13)

In [5]:
train.isnull().sum()

Loan_ID               0
Gender               15
Married               3
Dependents           16
Education             0
Self_Employed        39
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           17
Loan_Amount_Term     10
Credit_History       48
Property_Area         0
outcome               0
dtype: int64

In [6]:
test=pd.read_csv('Credit_Risk_Test_data.csv',index_col=0)

In [7]:
test.shape

(302, 13)

In [8]:
test.isnull().sum()

Loan_ID               0
Gender                9
Married               0
Dependents            9
Education             0
Self_Employed        16
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           10
Loan_Amount_Term     10
Credit_History       31
Property_Area         0
Loan_Status           0
dtype: int64

In [9]:
train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,outcome
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
4,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y

In [10]:
test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
2,LP001011,Male,Yes,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y
3,LP001020,Male,Yes,1,Graduate,No,12841,10968.0,349.0,360.0,1.0,Semiurban,N
4,LP001024,Male,Yes,2,Graduate,No,3200,700.0,70.0,360.0,1.0,Urban,Y
5,LP001034,Male,No,1,Not Graduate,No,3596,0.0,100.0,240.0,NaN,Urban,Y

In [11]:
train.rename(columns={"outcome": "Loan_Status"},inplace=True)

In [12]:
train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
4,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y

In [13]:
final=pd.concat([train,test],axis=0,ignore_index=True)

In [14]:
final.shape

(981, 13)

In [15]:
final.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [16]:
final.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
4,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y

In [17]:
from collections import Counter

In [18]:
Counter(final['Gender'])

Counter({'Male': 775, 'Female': 182, nan: 24})

In [19]:
final['Gender'].fillna(value='Male',inplace=True)

In [20]:
final.isnull().sum()

Loan_ID               0
Gender                0
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [21]:
Counter(final['Married'])

Counter({'No': 347, 'Yes': 631, nan: 3})

In [22]:
final['Married'].mode()

0    Yes
dtype: object

In [23]:
final['Married'].fillna(value='Yes',inplace=True)

In [24]:
final.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [25]:
Counter(final['Dependents'])

Counter({'0': 545, '1': 160, '3+': 91, '2': 160, nan: 25})

In [26]:
final['Dependents'].fillna(value='0',inplace=True)

In [27]:
final.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [28]:
Counter(final['Self_Employed'])

Counter({'No': 807, 'Yes': 119, nan: 55})

In [29]:
final['Self_Employed'].mode()

0    No
dtype: object

In [30]:
final['Self_Employed'].fillna(value='No',inplace=True)

In [31]:
final.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [32]:
final['Credit_History'].fillna(value=1.0,inplace=True)

In [33]:
final.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History        0
Property_Area         0
Loan_Status           0
dtype: int64

In [34]:
pd.crosstab(final['LoanAmount'].isnull(),final['Loan_Amount_Term'])

Loan_Amount_Term,6.0,12.0,36.0,60.0,84.0,120.0,180.0,240.0,300.0,350.0,360.0,480.0
LoanAmount,,,,,,,,,,,,
False,1,2,3,3,7,4,64,7,20,1,800,22
True,0,0,0,0,0,0,2,1,0,0,23,1

In [35]:
final.groupby(['Loan_Amount_Term'])['LoanAmount'].mean()

Loan_Amount_Term
6.0       95.000000
12.0     185.500000
36.0     117.666667
60.0     139.666667
84.0     121.142857
120.0     36.750000
180.0    131.125000
240.0    128.857143
300.0    166.250000
350.0    133.000000
360.0    144.420000
480.0    137.181818
Name: LoanAmount, dtype: float64

In [36]:
final['LoanAmount'][(final['LoanAmount'].isnull())& (final['Loan_Amount_Term']==360)]=144

C:\Users\Nitish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [37]:
pd.crosstab(final['LoanAmount'].isnull(),final['Loan_Amount_Term'])

Loan_Amount_Term,6.0,12.0,36.0,60.0,84.0,120.0,180.0,240.0,300.0,350.0,360.0,480.0
LoanAmount,,,,,,,,,,,,
False,1,2,3,3,7,4,64,7,20,1,823,22
True,0,0,0,0,0,0,2,1,0,0,0,1

In [38]:
final['LoanAmount'][final['LoanAmount'].isnull()]=132

C:\Users\Nitish\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [39]:
pd.crosstab(final['LoanAmount'].isnull(),final['Loan_Amount_Term'])

Loan_Amount_Term,6.0,12.0,36.0,60.0,84.0,120.0,180.0,240.0,300.0,350.0,360.0,480.0
LoanAmount,,,,,,,,,,,,
False,1,2,3,3,7,4,66,8,20,1,823,23

In [40]:
final.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term     20
Credit_History        0
Property_Area         0
Loan_Status           0
dtype: int64

In [41]:
final['Loan_Amount_Term'].mode()

0    360.0
dtype: float64

In [42]:
final['Loan_Amount_Term'].fillna(value=360,inplace=True)

In [43]:
final.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [44]:
final.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,144.0,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
4,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y

In [45]:
df1=pd.get_dummies(final.drop(['Loan_ID','ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term','Loan_Status','Credit_History'],axis=1),drop_first=True)

In [46]:
df1.head()

,Gender_Male,Married_Yes,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
0,1,0,0,0,0,0,0,0,1
1,1,1,1,0,0,0,0,0,0
2,1,1,0,0,0,0,1,0,1
3,1,0,0,0,0,0,0,0,1
4,1,1,0,0,0,1,0,0,1

In [47]:
df2=pd.concat([final,df1],axis=1)

In [48]:
df2.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,...,Loan_Status,Gender_Male,Married_Yes,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
0,LP001002,Male,No,0,Graduate,No,5849,0.0,144.0,360.0,...,Y,1,0,0,0,0,0,0,0,1
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,...,N,1,1,1,0,0,0,0,0,0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,...,Y,1,1,0,0,0,0,1,0,1
3,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,...,Y,1,0,0,0,0,0,0,0,1
4,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,...,Y,1,1,0,0,0,1,0,0,1

In [49]:
df2.to_csv("df2.csv")

In [50]:
df2.shape

(981, 22)

In [51]:
df3=df2.drop(['Loan_ID','Gender','Married','Dependents','Education','Self_Employed','Property_Area'],axis=1)

In [52]:
df3.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Gender_Male,Married_Yes,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
0,5849,0.0,144.0,360.0,1.0,Y,1,0,0,0,0,0,0,0,1
1,4583,1508.0,128.0,360.0,1.0,N,1,1,1,0,0,0,0,0,0
2,3000,0.0,66.0,360.0,1.0,Y,1,1,0,0,0,0,1,0,1
3,6000,0.0,141.0,360.0,1.0,Y,1,0,0,0,0,0,0,0,1
4,2333,1516.0,95.0,360.0,1.0,Y,1,1,0,0,0,1,0,0,1

In [53]:
indep1=list(df3.columns)
indep1

['ApplicantIncome',
 'CoapplicantIncome',
 'LoanAmount',
 'Loan_Amount_Term',
 'Credit_History',
 'Loan_Status',
 'Gender_Male',
 'Married_Yes',
 'Dependents_1',
 'Dependents_2',
 'Dependents_3+',
 'Education_Not Graduate',
 'Self_Employed_Yes',
 'Property_Area_Semiurban',
 'Property_Area_Urban']

In [54]:
indep1.remove(indep1[5])

In [55]:
indep1

['ApplicantIncome',
 'CoapplicantIncome',
 'LoanAmount',
 'Loan_Amount_Term',
 'Credit_History',
 'Gender_Male',
 'Married_Yes',
 'Dependents_1',
 'Dependents_2',
 'Dependents_3+',
 'Education_Not Graduate',
 'Self_Employed_Yes',
 'Property_Area_Semiurban',
 'Property_Area_Urban']

In [56]:
X=df3[['Credit_History','Married_Yes']]

In [57]:
Y=df3['Loan_Status']

In [58]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size=0.3,random_state=1)

In [59]:
X_train.head()

     Credit_History  Married_Yes
786             1.0            1
788             1.0            1
721             1.0            1
868             1.0            1
939             1.0            1

In [60]:
X_train.shape

(686, 2)

In [61]:
from sklearn.svm import SVC
from sklearn.model_selection import GridSearchCV
#k=['rbf', 'linear','poly','sigmoid','precomputed']
k=['linear']
c= list(range(1,4))
g=np.arange(0.1,0.3,0.1)
param_grid=dict(kernel=k, C=c, gamma=g)
new_model=SVC()

In [62]:
grid = GridSearchCV(new_model, param_grid,scoring='accuracy')

In [63]:
param_grid

{'C': [1, 2, 3], 'gamma': array([ 0.1,  0.2]), 'kernel': ['linear']}

In [64]:
grid.fit(X_train, y_train)

GridSearchCV(cv=None, error_score='raise',
       estimator=SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto', kernel='rbf',
  max_iter=-1, probability=False, random_state=None, shrinking=True,
  tol=0.001, verbose=False),
       fit_params=None, iid=True, n_jobs=1,
       param_grid={'kernel': ['linear'], 'C': [1, 2, 3], 'gamma': array([ 0.1,  0.2])},
       pre_dispatch='2*n_jobs', refit=True, return_train_score=True,
       scoring='accuracy', verbose=0)

In [65]:
print(grid.best_params_)

{'C': 1, 'gamma': 0.10000000000000001, 'kernel': 'linear'}

In [66]:
print("train Accuaracy: ", grid.score(X_train, y_train)) #on the training data
#Check accuracy on test
print("test Accuaracy: ", grid.score(X_test,y_test))

train Accuaracy:  0.855685131195
test Accuaracy:  0.871186440678

In [67]:
df3.shape

(981, 15)

In [68]:
final_train=pd.DataFrame(data=[df3.iloc[i] for i in range(0,679)])

In [69]:
final_train.shape

(679, 15)

In [70]:
final_train.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Gender_Male,Married_Yes,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
0,5849,0.0,144.0,360.0,1.0,Y,1,0,0,0,0,0,0,0,1
1,4583,1508.0,128.0,360.0,1.0,N,1,1,1,0,0,0,0,0,0
2,3000,0.0,66.0,360.0,1.0,Y,1,1,0,0,0,0,1,0,1
3,6000,0.0,141.0,360.0,1.0,Y,1,0,0,0,0,0,0,0,1
4,2333,1516.0,95.0,360.0,1.0,Y,1,1,0,0,0,1,0,0,1

In [71]:
#y_train=pd.DataFrame(data=[dv_total.iloc[i] for i in range(0,679)])

In [72]:
#y_train.shape

In [73]:
#y_train.head()

In [74]:
#X_test=pd.DataFrame(data=[iv_total.iloc[i] for i in range(679,981)])

In [75]:
#X_test.shape

In [76]:
#y_test=pd.DataFrame(data=[dv_total.iloc[i] for i in range(679,981)])

In [77]:
#y_test.shape

In [78]:
final_test=pd.DataFrame(data=[df3.iloc[i] for i in range(679,981)])

In [79]:
final_test.shape

(302, 15)

In [80]:
final_test.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Gender_Male,Married_Yes,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
679,2583,2358.0,120.0,360.0,1.0,Y,1,1,0,0,0,1,0,0,1
680,5417,4196.0,267.0,360.0,1.0,Y,1,1,0,1,0,0,1,0,1
681,12841,10968.0,349.0,360.0,1.0,N,1,1,1,0,0,0,0,1,0
682,3200,700.0,70.0,360.0,1.0,Y,1,1,0,1,0,0,0,0,1
683,3596,0.0,100.0,240.0,1.0,Y,1,0,1,0,0,1,0,0,1

In [81]:
X_train1=final_train.drop(['Loan_Status'],axis=1)

In [82]:
X_train1.head(1)

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Male,Married_Yes,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
0,5849,0.0,144.0,360.0,1.0,1,0,0,0,0,0,0,0,1

In [83]:
final_train.head(2)

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Gender_Male,Married_Yes,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
0,5849,0.0,144.0,360.0,1.0,Y,1,0,0,0,0,0,0,0,1
1,4583,1508.0,128.0,360.0,1.0,N,1,1,1,0,0,0,0,0,0

In [84]:
y_train1=final_train['Loan_Status']

In [85]:
X_test1=final_test.drop(['Loan_Status'],axis=1)

In [86]:
y_test1=final_test['Loan_Status']

In [87]:
from sklearn.svm import SVC
from sklearn.model_selection import GridSearchCV
#k=['rbf', 'linear','poly','sigmoid','precomputed']
k=['linear']
c= list(range(1,5))
g=np.arange(0.1,0.3,0.1)
param_grid=dict(kernel=k, C=c, gamma=g)
new_model=SVC()

In [88]:
grid = GridSearchCV(new_model, param_grid,scoring='accuracy')

In [ ]:
param_grid

{'C': [1, 2, 3, 4], 'gamma': array([ 0.1,  0.2]), 'kernel': ['linear']}

In [ ]:
grid.fit(X_train1, y_train1)

In [ ]:
print(grid.best_params_)

In [ ]:
print("train Accuaracy: ", grid.score(X_train1, y_train1)) #on the training data
#Check accuracy on test
print("test Accuaracy: ", grid.score(X_test1,y_test1))

In [ ]:
fdsfd

In [ ]:
from sklearn.svm import SVC # "Support vector classifier"
model = SVC(kernel='linear', C=2,gamma=0.1)
model.fit(X_train, y_train)

In [ ]:
print("train Accuaracy: ", model.score(X_train, y_train)) #on the training data
#Check accuracy on test
print("test Accuaracy: ", model.score(X_test,y_test))